# В фермерском хозяйстве Карелии выращивают чернику. Она растет на круглой грядке,
#  причем кусты высажены только по окружности. Таким образом,
#  у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод
# – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
#  Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
#  которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.


print('Введите количество кустов: ')
n = int(input())
print('Введите количество ягод на каждом кусте через пробел: ')
a = list(map(int, input().split()))
max_berries = 0

for i in range(n):

    berries = a[i] + a[(i + 1) % n] + a[(i + n - 1) % n]
    if berries > max_berries:
        max_berries = berries

print(max_berries)
